Tarea 1 
===
Alumno: Jorge Isaac Coello Berrios 
N° de cuenta: 20161003898 
Sección: 1900

In [33]:
import pandas as pd

Lectura de las tablas de dimensiones

Dimension Alumno

In [3]:
pd.read_csv('Dim_Alumno.csv')

   Id_Maestro           Nombre  Id_Clase
0           1     Renae Cantua         1
1           2  Yulma Barnewall         2
2           3      Blair Reddy         3
3           4  Bendick Nolleth         4
4           5   Veriee Deetlof         5
5           6    Greg Marcombe         6
6           7    Yancy Jerrans         7
7           8     Rachel Boeck         8
8           9   Hannie Demaine         9
9          10  Shandeigh Haire        10

Dimension Maestro

In [4]:
pd.read_csv('Dim_Maestro.csv')

   Id_Maestro           Nombre  Id_Clase
0           1     Renae Cantua         1
1           2  Yulma Barnewall         2
2           3      Blair Reddy         3
3           4  Bendick Nolleth         4
4           5   Veriee Deetlof         5
5           6    Greg Marcombe         6
6           7    Yancy Jerrans         7
7           8     Rachel Boeck         8
8           9   Hannie Demaine         9
9          10  Shandeigh Haire        10

Dimension Clase

In [5]:
pd.read_csv('Dim_Clase.csv')

   Id_Clase                                             Nombre  Unidades
0         1                                             Arthur         8
1         2  Defender, The (a.k.a. Bodyguard from Beijing, ...         8
2         3                                      I'm with Lucy         3
3         4                              Four Men and a Prayer         2
4         5                         Small Circle of Friends, A         7
5         6                           Sammy and Rosie Get Laid         7
6         7                                        Saving Face         2
7         8                                       Château, The         2
8         9                 Behind the Sun (Abril Despedaçado)         5
9        10                    City of Violence, The (Jjakpae)         4

Dimension Carrera

In [17]:
pd.read_csv('Dim_Carrera.csv')

   Id_Carrera       Nombre  Duracion
0           1       Vagram         7
1           2     Transcof         7
2           3         Rank         7
3           4      Veribet         7
4           5  Solarbreeze         5
5           6       Duobam         4
6           7        Alpha         6
7           8    Voyatouch         5
8           9   Voltsillam         4
9          10      Konklab         5

Lectura Tabla Hechos

In [57]:
hechos= {
	'id': [154,107,160,100,152,135,148,197,156,103],
	'NumeroCuenta': ["3607607834","3934993575","0757142974","1216386676","8083186627","7999158100","3477460014","0206624697","8351656801","3524318134"],
	'Id_Clase':[1,2,3,4,5,6,7,8,9,10],
	'Id_Carrera':[1,2,3,4,5,6,7,8,9,10],
	'Id_Maestro':[1,2,3,4,5,6,7,8,9,10],
	'Promedio': [91,32,14,83,50,66,78,29,16,97]
}

In [58]:
df = pd.DataFrame(hechos)
json = df.to_json(orient = 'table')
print(json)

{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"id","type":"integer"},{"name":"NumeroCuenta","type":"string"},{"name":"Id_Clase","type":"integer"},{"name":"Id_Carrera","type":"integer"},{"name":"Id_Maestro","type":"integer"},{"name":"Promedio","type":"integer"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":0,"id":154,"NumeroCuenta":"3607607834","Id_Clase":1,"Id_Carrera":1,"Id_Maestro":1,"Promedio":91},{"index":1,"id":107,"NumeroCuenta":"3934993575","Id_Clase":2,"Id_Carrera":2,"Id_Maestro":2,"Promedio":32},{"index":2,"id":160,"NumeroCuenta":"0757142974","Id_Clase":3,"Id_Carrera":3,"Id_Maestro":3,"Promedio":14},{"index":3,"id":100,"NumeroCuenta":"1216386676","Id_Clase":4,"Id_Carrera":4,"Id_Maestro":4,"Promedio":83},{"index":4,"id":152,"NumeroCuenta":"8083186627","Id_Clase":5,"Id_Carrera":5,"Id_Maestro":5,"Promedio":50},{"index":5,"id":135,"NumeroCuenta":"7999158100","Id_Clase":6,"Id_Carrera":6,"Id_Maestro":6,"Promedio":66},{"index":6,"id":148,"NumeroCuenta":"3477460014","Id_Clase":7,"Id_Carrera":7,"Id_Maestro":7,"Promedio":78},{"index":7,"id":197,"NumeroCuenta":"0206624697","Id_Clase":8,"Id_Carrera":8,"Id_Maestro":8,"Promedio":29},{"index":8,"id":156,"NumeroCuenta":"8351656801","Id_Clase":9,"Id_Carrera":9,"Id_Maestro":9,"Promedio":16},{"index":9,"id":103,"NumeroCuenta":"3524318134","Id_Clase":10,"Id_Carrera":10,"Id_Maestro":10,"Promedio":97}]}

Uso del join

In [61]:
hechos2 = pd.DataFrame({
	'id': [155,117,166,200,122,125,138,97,56,133],
	'NumeroCuenta': ["3607607834","3934993575","0757142974","1216386676","8083186627","7999158100","3477460014","0206624697","8351656801","3524318134"],
	'Id_Clase':[1,2,3,4,5,6,7,8,9,10],
	'Id_Carrera':[1,2,3,4,5,6,7,8,9,10],
	'Id_Maestro':[1,2,3,4,5,6,7,8,9,10],
	'Promedio': [91,32,14,83,50,66,78,29,16,97]
})

In [62]:
df.join(hechos2, rsuffix='hechos2')

,id,NumeroCuenta,Id_Clase,Id_Carrera,Id_Maestro,Promedio,idhechos2,NumeroCuentahechos2,Id_Clasehechos2,Id_Carrerahechos2,Id_Maestrohechos2,Promediohechos2
0,154,3607607834,1,1,1,91,155,3607607834,1,1,1,91
1,107,3934993575,2,2,2,32,117,3934993575,2,2,2,32
2,160,0757142974,3,3,3,14,166,0757142974,3,3,3,14
3,100,1216386676,4,4,4,83,200,1216386676,4,4,4,83
4,152,8083186627,5,5,5,50,122,8083186627,5,5,5,50
5,135,7999158100,6,6,6,66,125,7999158100,6,6,6,66
6,148,3477460014,7,7,7,78,138,3477460014,7,7,7,78
7,197,0206624697,8,8,8,29,97,0206624697,8,8,8,29
8,156,8351656801,9,9,9,16,56,8351656801,9,9,9,16
9,103,3524318134,10,10,10,97,133,3524318134,10,10,10,97

Mayor promedio

In [64]:
df['Promedio'].max()

97

Notas reprobadas

In [66]:
df[df['Promedio']<65]

    id NumeroCuenta  Id_Clase  Id_Carrera  Id_Maestro  Promedio
1  107   3934993575         2           2           2        32
2  160   0757142974         3           3           3        14
4  152   8083186627         5           5           5        50
7  197   0206624697         8           8           8        29
8  156   8351656801         9           9           9        16

Maestros cuyos alumnos aprobaron la clase

In [67]:
df[['Id_Maestro','Promedio']][df.Promedio >= 65]

   Id_Maestro  Promedio
0           1        91
3           4        83
5           6        66
6           7        78
9          10        97